chirags98/Edge_ML_STM32N6/projects/STM32CubeN6/Projects/STM32N6570-DK/Templates/Template_FSBL_XIP/Template_FSBL_XIP.ioc
#MicroXplorer Configuration settings - do not modify
Appli.IPs=CORTEX_M55_S,GPDMA1,HPDMA1,LINKEDLIST,RCC,GPIO,NVIC1\:I,RIF,SAU,LTDC,DCMIPP,CSI,I2C1,RAMCFG,XSPI1
Appli.Pins=PQ6,PD2,PQ3,PC8,PE1
CAD.formats=
CAD.pinconfig=
CAD.provider=
CORTEX_M55_FSBL.CPU_DCache=Enabled
CORTEX_M55_FSBL.CPU_ICache=Enabled
CORTEX_M55_FSBL.IPParameters=CPU_ICache,CPU_DCache
CORTEX_M55_S.AccessPermission-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_ALL_RW
CORTEX_M55_S.AccessPermission-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_ALL_RW
CORTEX_M55_S.Attributes0=MPU_ATTRIBUTES_NUMBER0
CORTEX_M55_S.BaseAddress-Cortex_Memory_Protection_Unit_Region0_Settings=__NON_CACHEABLE_SECTION_BEGIN
CORTEX_M55_S.BaseAddress-Cortex_Memory_Protection_Unit_Region1_Settings=0x90000000
CORTEX_M55_S.CPU_DCache=Enabled
CORTEX_M55_S.CPU_ICache=Enabled
CORTEX_M55_S.Enable-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_ENABLE
CORTEX_M55_S.Enable-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_ENABLE
CORTEX_M55_S.IPParameters=CPU_ICache,CPU_DCache,MPU_Control,Enable-Cortex_Memory_Protection_Unit_Region0_Settings,Attributes0,BaseAddress-Cortex_Memory_Protection_Unit_Region0_Settings,LimitAddress-Cortex_Memory_Protection_Unit_Region0_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region0_Settings,Enable-Cortex_Memory_Protection_Unit_Region1_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region1_Settings,LimitAddress-Cortex_Memory_Protection_Unit_Region1_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region1_Settings
CORTEX_M55_S.LimitAddress-Cortex_Memory_Protection_Unit_Region0_Settings=__NON_CACHEABLE_SECTION_END
CORTEX_M55_S.LimitAddress-Cortex_Memory_Protection_Unit_Region1_Settings=0x91FFFFFF 
CORTEX_M55_S.MPU_Control=MPU_HFNMI_PRIVDEF
CSI_CKN.GPIOParameters=PinAttribute
CSI_CKN.Mode=CSI
CSI_CKN.PinAttribute=Appli
CSI_CKN.Signal=CSI_CKN
CSI_CKP.GPIOParameters=PinAttribute
CSI_CKP.Mode=CSI
CSI_CKP.PinAttribute=Appli
CSI_CKP.Signal=CSI_CKP
CSI_D0N.GPIOParameters=PinAttribute
CSI_D0N.Mode=CSI
CSI_D0N.PinAttribute=Appli
CSI_D0N.Signal=CSI_D0N
CSI_D0P.GPIOParameters=PinAttribute
CSI_D0P.Mode=CSI
CSI_D0P.PinAttribute=Appli
CSI_D0P.Signal=CSI_D0P
CSI_D1N.GPIOParameters=PinAttribute
CSI_D1N.Mode=CSI
CSI_D1N.PinAttribute=Appli
CSI_D1N.Signal=CSI_D1N
CSI_D1P.GPIOParameters=PinAttribute
CSI_D1P.Mode=CSI
CSI_D1P.PinAttribute=Appli
CSI_D1P.Signal=CSI_D1P
CSI_REXT.GPIOParameters=PinAttribute
CSI_REXT.Mode=CSI
CSI_REXT.PinAttribute=Appli
CSI_REXT.Signal=CSI_REXT
DCMIPP.DCMIPP_CSI_DATA_TYPE_FORMAT1=DCMIPP_CSI_DT_BPP10
DCMIPP.DCMIPP_CSI_DATA_TYPE_FORMAT2=DCMIPP_CSI_DT_BPP10
DCMIPP.DataTypeIDAPIPE1=DCMIPP_DT_RAW10
DCMIPP.DataTypeIDAPIPE2=DCMIPP_DT_RAW10
DCMIPP.DataTypeIDBPIPE1=DCMIPP_DT_RAW10
DCMIPP.DataTypeIDBPIPE2=DCMIPP_DT_RAW10
DCMIPP.IPParameters=NumberOfLanesPIPE1,PHYBitratePIPE1,DataTypeIDAPIPE1,DataTypeIDBPIPE1,PixelPipePitchPIPE1,PixelPipeFormatPIPE1,DCMIPP_CSI_DATA_TYPE_FORMAT1,DataTypeIDAPIPE2,DataTypeIDBPIPE2,NumberOfLanesPIPE2,DCMIPP_CSI_DATA_TYPE_FORMAT2,PHYBitratePIPE2,PixelPipePitchPIPE2
DCMIPP.NumberOfLanesPIPE1=DCMIPP_CSI_TWO_DATA_LANES
DCMIPP.NumberOfLanesPIPE2=DCMIPP_CSI_TWO_DATA_LANES
DCMIPP.PHYBitratePIPE1=DCMIPP_CSI_PHY_BT_1600
DCMIPP.PHYBitratePIPE2=DCMIPP_CSI_PHY_BT_1600
DCMIPP.PixelPipeFormatPIPE1=DCMIPP_PIXEL_PACKER_FORMAT_RGB565_1
DCMIPP.PixelPipePitchPIPE1=1280
DCMIPP.PixelPipePitchPIPE2=384
ExtMemLoader.IPs=EXTMEM_LOADER,EXTMEM_MANAGER,RCC\:I,GPIO,TIM6
FSBL.IPs=CORTEX_M55_FSBL,GPDMA1\:I,HDP,HPDMA1\:I,LINKEDLIST,RCC,GPIO\:I,NVIC\:I,XSPIM,XSPI2,XSPI1
File.Version=6
GPIO.groupedBy=Group By Peripherals
I2C1.I2C_Speed_Mode=I2C_Fast
I2C1.IPParameters=Timing,I2C_Speed_Mode
I2C1.Timing=0x00200B2B
KeepUserPlacement=false
LTDC.ActiveW=800
LTDC.Alpha_L0=255
LTDC.Alpha_L1=255
LTDC.Blue_L0=255
LTDC.Blue_L1=255
LTDC.DEPolarity=LTDC_DEPOLARITY_AH
LTDC.HBP=8
LTDC.HFP=8
LTDC.HSync=4
LTDC.IPParameters=HSync,HBP,ActiveW,HFP,VBP,VFP,DEPolarity,WindowX1_L0,WindowY1_L0,WindowX1_L1,WindowY1_L1,PixelFormat_L0,PixelFormat_L1,Alpha_L0,Alpha_L1,Blue_L0,Blue_L1,ImageWidth_L0,ImageHeight_L0,ImageWidth_L1,ImageHeight_L1,Layers,WindowX0_L0
LTDC.ImageHeight_L0=480
LTDC.ImageHeight_L1=480
LTDC.ImageWidth_L0=640
LTDC.ImageWidth_L1=800
LTDC.Layers=0
LTDC.PixelFormat_L0=LTDC_PIXEL_FORMAT_RGB565
LTDC.PixelFormat_L1=LTDC_PIXEL_FORMAT_RGB565
LTDC.VBP=8
LTDC.VFP=8
LTDC.WindowX0_L0=80
LTDC.WindowX1_L0=720
LTDC.WindowX1_L1=800
LTDC.WindowY1_L0=480
LTDC.WindowY1_L1=480
Mcu.CPN=STM32N657X0H3Q
Mcu.Context0=FSBL
Mcu.Context1=Appli
Mcu.Context2=ExtMemLoader
Mcu.ContextNb=3
Mcu.ContextProject=FullSecure
Mcu.Family=STM32N6
Mcu.IP0=CORTEX_M55_FSBL
Mcu.IP1=CORTEX_M55_S
Mcu.IP10=RIF
Mcu.IP11=XSPI1
Mcu.IP12=XSPI2
Mcu.IP13=XSPIM
Mcu.IP2=CSI
Mcu.IP3=DCMIPP
Mcu.IP4=I2C1
Mcu.IP5=LTDC
Mcu.IP6=NVIC1
Mcu.IP7=NVIC
Mcu.IP8=RAMCFG
Mcu.IP9=RCC
Mcu.IPNb=14
Mcu.Name=STM32N657X0HxQ
Mcu.Package=VFBGA264
Mcu.Pin0=PQ6
Mcu.Pin1=PC1
Mcu.Pin10=PC8
Mcu.Pin11=PH9
Mcu.Pin12=PB15
Mcu.Pin13=PE11
Mcu.Pin14=PD8
Mcu.Pin15=PH4
Mcu.Pin16=PE1
Mcu.Pin17=PP7
Mcu.Pin18=PP6
Mcu.Pin19=PP0
Mcu.Pin2=PH3
Mcu.Pin20=PD9
Mcu.Pin21=PP4
Mcu.Pin22=PP1
Mcu.Pin23=PP15
Mcu.Pin24=PP5
Mcu.Pin25=PP12
Mcu.Pin26=PP3
Mcu.Pin27=PP2
Mcu.Pin28=PP13
Mcu.Pin29=PO2
Mcu.Pin3=PH6
Mcu.Pin30=PG6
Mcu.Pin31=PP11
Mcu.Pin32=PP8
Mcu.Pin33=PP14
Mcu.Pin34=PO3
Mcu.Pin35=PO0
Mcu.Pin36=PP9
Mcu.Pin37=PP10
Mcu.Pin38=PO4
Mcu.Pin39=PN4
Mcu.Pin4=PD15
Mcu.Pin40=CSI_REXT
Mcu.Pin41=PA1
Mcu.Pin42=PB11
Mcu.Pin43=PA15(JTDI)
Mcu.Pin44=PN6
Mcu.Pin45=PN8
Mcu.Pin46=PN0
Mcu.Pin47=PG15
Mcu.Pin48=PG1
Mcu.Pin49=PB12
Mcu.Pin5=PB14
Mcu.Pin50=PA7
Mcu.Pin51=PG0
Mcu.Pin52=PN3
Mcu.Pin53=PN5
Mcu.Pin54=PN1
Mcu.Pin55=CSI_CKP
Mcu.Pin56=CSI_D1P
Mcu.Pin57=CSI_D0P
Mcu.Pin58=PA2
Mcu.Pin59=PG12
Mcu.Pin6=PD2
Mcu.Pin60=PB4(NJTRST)
Mcu.Pin61=PG8
Mcu.Pin62=PN9
Mcu.Pin63=PN2
Mcu.Pin64=CSI_CKN
Mcu.Pin65=CSI_D1N
Mcu.Pin66=CSI_D0N
Mcu.Pin67=PA8
Mcu.Pin68=PG13
Mcu.Pin69=PA0
Mcu.Pin7=PB13
Mcu.Pin70=PG11
Mcu.Pin71=PN10
Mcu.Pin72=PN11
Mcu.Pin73=VP_DCMIPP_VS_PIPE1
Mcu.Pin74=VP_DCMIPP_VS_PIPE2
Mcu.Pin75=VP_DCMIPP_CSI
Mcu.Pin76=VP_RAMCFG_VS_RAMCFG4
Mcu.Pin77=VP_RAMCFG_VS_RAMCFG5
Mcu.Pin78=VP_RIF_VS_RIF1
Mcu.Pin79=VP_XSPI1_VS_hexa
Mcu.Pin8=PB2
Mcu.Pin80=VP_XSPI2_VS_octo
Mcu.Pin81=VP_XSPIM_VS_IO
Mcu.Pin9=PQ3
Mcu.PinsNb=82
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32N657X0HxQ
MxCube.Version=6.17.0
MxDb.Version=DB.6.0.170
NVIC.BFHFNMINS=0
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PRIS=0
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SecureFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.BFHFNMINS=0
NVIC1.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.CSI_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC1.DCMIPP_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC1.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.ForceEnableDMAVector=true
NVIC1.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.PRIS=0
NVIC1.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC1.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.SecureFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC1.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA0.GPIOParameters=PinAttribute
PA0.Locked=true
PA0.Mode=RGB888
PA0.PinAttribute=Appli
PA0.Signal=LTDC_G3
PA1.GPIOParameters=PinAttribute
PA1.Mode=RGB888
PA1.PinAttribute=Appli
PA1.Signal=LTDC_G2
PA15(JTDI).GPIOParameters=PinAttribute
PA15(JTDI).Mode=RGB888
PA15(JTDI).PinAttribute=Appli
PA15(JTDI).Signal=LTDC_R5
PA2.GPIOParameters=PinAttribute
PA2.Locked=true
PA2.Mode=RGB888
PA2.PinAttribute=Appli
PA2.Signal=LTDC_B7
PA7.GPIOParameters=PinAttribute
PA7.Locked=true
PA7.Mode=RGB888
PA7.PinAttribute=Appli
PA7.Signal=LTDC_B1
PA8.GPIOParameters=PinAttribute
PA8.Mode=RGB888
PA8.PinAttribute=Appli
PA8.Signal=LTDC_B6
PB11.GPIOParameters=PinAttribute
PB11.Mode=RGB888
PB11.PinAttribute=Appli
PB11.Signal=LTDC_G6
PB12.GPIOParameters=PinAttribute
PB12.Mode=RGB888
PB12.PinAttribute=Appli
PB12.Signal=LTDC_G5
PB13.GPIOParameters=PinAttribute
PB13.Locked=true
PB13.Mode=RGB888
PB13.PinAttribute=Appli
PB13.Signal=LTDC_CLK
PB14.GPIOParameters=PinAttribute
PB14.Mode=RGB888
PB14.PinAttribute=Appli
PB14.Signal=LTDC_HSYNC
PB15.GPIOParameters=PinAttribute
PB15.Mode=RGB888
PB15.PinAttribute=Appli
PB15.Signal=LTDC_G4
PB2.GPIOParameters=PinAttribute
PB2.Mode=RGB888
PB2.PinAttribute=Appli
PB2.Signal=LTDC_B2
PB4(NJTRST).GPIOParameters=PinAttribute
PB4(NJTRST).Locked=true
PB4(NJTRST).Mode=RGB888
PB4(NJTRST).PinAttribute=Appli
PB4(NJTRST).Signal=LTDC_R3
PC1.GPIOParameters=PinAttribute
PC1.Mode=I2C
PC1.PinAttribute=Appli
PC1.Signal=I2C1_SDA
PC8.ContextOwner=Appli
PC8.GPIOParameters=GPIO_Label,PinAttribute
PC8.GPIO_Label=NRST
PC8.Locked=true
PC8.PinAttribute=Appli
PC8.Signal=GPIO_Output
PCC.Checker=false
PCC.Display=Plot\: All Steps
PCC.Line=STM32N6x7
PCC.MCU=STM32N657X0HxQ
PCC.PartNumber=STM32N657X0HxQ
PCC.Series=STM32N6
PCC.Temperature=25
PCC.Vdd=1.8
PD15.GPIOParameters=PinAttribute
PD15.Mode=RGB888
PD15.PinAttribute=Appli
PD15.Signal=LTDC_R2
PD2.ContextOwner=Appli
PD2.GPIOParameters=GPIO_Label,PinAttribute
PD2.GPIO_Label=PWR_EN
PD2.Locked=true
PD2.PinAttribute=Appli
PD2.Signal=GPIO_Output
PD8.GPIOParameters=PinAttribute
PD8.Mode=RGB888
PD8.PinAttribute=Appli
PD8.Signal=LTDC_R7
PD9.GPIOParameters=PinAttribute
PD9.Mode=RGB888
PD9.PinAttribute=Appli
PD9.Signal=LTDC_R1
PE1.ContextOwner=Appli
PE1.GPIOParameters=GPIO_Label,PinAttribute
PE1.GPIO_Label=LCD_NRST
PE1.Locked=true
PE1.PinAttribute=Appli
PE1.Signal=GPIO_Output
PE11.GPIOParameters=PinAttribute
PE11.Mode=RGB888
PE11.PinAttribute=Appli
PE11.Signal=LTDC_VSYNC
PG0.GPIOParameters=PinAttribute
PG0.Mode=RGB888
PG0.PinAttribute=Appli
PG0.Signal=LTDC_R0
PG1.GPIOParameters=PinAttribute
PG1.Locked=true
PG1.Mode=RGB888
PG1.PinAttribute=Appli
PG1.Signal=LTDC_G1
PG11.GPIOParameters=PinAttribute
PG11.Locked=true
PG11.Mode=RGB888
PG11.PinAttribute=Appli
PG11.Signal=LTDC_R6
PG12.GPIOParameters=PinAttribute
PG12.Locked=true
PG12.Mode=RGB888
PG12.PinAttribute=Appli
PG12.Signal=LTDC_G0
PG13.GPIOParameters=PinAttribute
PG13.Locked=true
PG13.Mode=RGB888
PG13.PinAttribute=Appli
PG13.Signal=LTDC_DE
PG15.GPIOParameters=PinAttribute
PG15.Locked=true
PG15.Mode=RGB888
PG15.PinAttribute=Appli
PG15.Signal=LTDC_B0
PG6.GPIOParameters=PinAttribute
PG6.Locked=true
PG6.Mode=RGB888
PG6.PinAttribute=Appli
PG6.Signal=LTDC_B3
PG8.GPIOParameters=PinAttribute
PG8.Mode=RGB888
PG8.PinAttribute=Appli
PG8.Signal=LTDC_G7
PH3.GPIOParameters=PinAttribute
PH3.Mode=RGB888
PH3.PinAttribute=Appli
PH3.Signal=LTDC_B4
PH4.GPIOParameters=PinAttribute
PH4.Locked=true
PH4.Mode=RGB888
PH4.PinAttribute=Appli
PH4.Signal=LTDC_R4
PH6.GPIOParameters=PinAttribute
PH6.Mode=RGB888
PH6.PinAttribute=Appli
PH6.Signal=LTDC_B5
PH9.GPIOParameters=PinAttribute
PH9.Locked=true
PH9.Mode=I2C
PH9.PinAttribute=Appli
PH9.Signal=I2C1_SCL
PN0.GPIOParameters=PinAttribute
PN0.Mode=XSPI2_Port2Octo
PN0.PinAttribute=FSBL
PN0.Signal=XSPIM_P2_DQS0
PN1.GPIOParameters=PinAttribute
PN1.Mode=XSPI2_NCS1_Port2
PN1.PinAttribute=FSBL
PN1.Signal=XSPIM_P2_NCS1
PN10.GPIOParameters=PinAttribute
PN10.Mode=XSPI2_Port2Octo
PN10.PinAttribute=FSBL
PN10.Signal=XSPIM_P2_IO6
PN11.GPIOParameters=PinAttribute
PN11.Mode=XSPI2_Port2Octo
PN11.PinAttribute=FSBL
PN11.Signal=XSPIM_P2_IO7
PN2.GPIOParameters=PinAttribute
PN2.Mode=XSPI2_Port2Octo
PN2.PinAttribute=FSBL
PN2.Signal=XSPIM_P2_IO0
PN3.GPIOParameters=PinAttribute
PN3.Mode=XSPI2_Port2Octo
PN3.PinAttribute=FSBL
PN3.Signal=XSPIM_P2_IO1
PN4.GPIOParameters=PinAttribute
PN4.Mode=XSPI2_Port2Octo
PN4.PinAttribute=FSBL
PN4.Signal=XSPIM_P2_IO2
PN5.GPIOParameters=PinAttribute
PN5.Mode=XSPI2_Port2Octo
PN5.PinAttribute=FSBL
PN5.Signal=XSPIM_P2_IO3
PN6.GPIOParameters=PinAttribute
PN6.Mode=XSPI2_Port2Octo
PN6.PinAttribute=FSBL
PN6.Signal=XSPIM_P2_CLK
PN8.GPIOParameters=PinAttribute
PN8.Mode=XSPI2_Port2Octo
PN8.PinAttribute=FSBL
PN8.Signal=XSPIM_P2_IO4
PN9.GPIOParameters=PinAttribute
PN9.Mode=XSPI2_Port2Octo
PN9.PinAttribute=FSBL
PN9.Signal=XSPIM_P2_IO5
PO0.GPIOParameters=GPIO_PuPd,PinAttribute
PO0.GPIO_PuPd=GPIO_PULLUP
PO0.Locked=true
PO0.Mode=XSPI1_NCS1_Port1
PO0.PinAttribute=FSBL,Appli
PO0.Signal=XSPIM_P1_NCS1
PO2.GPIOParameters=GPIO_PuPd,PinAttribute
PO2.GPIO_PuPd=GPIO_PULLUP
PO2.Mode=XSPI1_Port1Hexa
PO2.PinAttribute=FSBL,Appli
PO2.Signal=XSPIM_P1_DQS0
PO3.GPIOParameters=GPIO_PuPd,PinAttribute
PO3.GPIO_PuPd=GPIO_PULLUP
PO3.Mode=XSPI1_Port1Hexa
PO3.PinAttribute=FSBL,Appli
PO3.Signal=XSPIM_P1_DQS1
PO4.GPIOParameters=GPIO_PuPd,PinAttribute
PO4.GPIO_PuPd=GPIO_PULLUP
PO4.Locked=true
PO4.Mode=XSPI1_Port1Hexa
PO4.PinAttribute=FSBL,Appli
PO4.Signal=XSPIM_P1_CLK
PP0.GPIOParameters=GPIO_PuPd,PinAttribute
PP0.GPIO_PuPd=GPIO_PULLUP
PP0.Mode=XSPI1_Port1Hexa
PP0.PinAttribute=FSBL,Appli
PP0.Signal=XSPIM_P1_IO0
PP1.GPIOParameters=GPIO_PuPd,PinAttribute
PP1.GPIO_PuPd=GPIO_PULLUP
PP1.Mode=XSPI1_Port1Hexa
PP1.PinAttribute=FSBL,Appli
PP1.Signal=XSPIM_P1_IO1
PP10.GPIOParameters=GPIO_PuPd,PinAttribute
PP10.GPIO_PuPd=GPIO_PULLUP
PP10.Mode=XSPI1_Port1Hexa
PP10.PinAttribute=FSBL,Appli
PP10.Signal=XSPIM_P1_IO10
PP11.GPIOParameters=GPIO_PuPd,PinAttribute
PP11.GPIO_PuPd=GPIO_PULLUP
PP11.Mode=XSPI1_Port1Hexa
PP11.PinAttribute=FSBL,Appli
PP11.Signal=XSPIM_P1_IO11
PP12.GPIOParameters=GPIO_PuPd,PinAttribute
PP12.GPIO_PuPd=GPIO_PULLUP
PP12.Mode=XSPI1_Port1Hexa
PP12.PinAttribute=FSBL,Appli
PP12.Signal=XSPIM_P1_IO12
PP13.GPIOParameters=GPIO_PuPd,PinAttribute
PP13.GPIO_PuPd=GPIO_PULLUP
PP13.Mode=XSPI1_Port1Hexa
PP13.PinAttribute=FSBL,Appli
PP13.Signal=XSPIM_P1_IO13
PP14.GPIOParameters=GPIO_PuPd,PinAttribute
PP14.GPIO_PuPd=GPIO_PULLUP
PP14.Mode=XSPI1_Port1Hexa
PP14.PinAttribute=FSBL,Appli
PP14.Signal=XSPIM_P1_IO14
PP15.GPIOParameters=GPIO_PuPd,PinAttribute
PP15.GPIO_PuPd=GPIO_PULLUP
PP15.Mode=XSPI1_Port1Hexa
PP15.PinAttribute=FSBL,Appli
PP15.Signal=XSPIM_P1_IO15
PP2.GPIOParameters=GPIO_PuPd,PinAttribute
PP2.GPIO_PuPd=GPIO_PULLUP
PP2.Mode=XSPI1_Port1Hexa
PP2.PinAttribute=FSBL,Appli
PP2.Signal=XSPIM_P1_IO2
PP3.GPIOParameters=GPIO_PuPd,PinAttribute
PP3.GPIO_PuPd=GPIO_PULLUP
PP3.Mode=XSPI1_Port1Hexa
PP3.PinAttribute=FSBL,Appli
PP3.Signal=XSPIM_P1_IO3
PP4.GPIOParameters=GPIO_PuPd,PinAttribute
PP4.GPIO_PuPd=GPIO_PULLUP
PP4.Mode=XSPI1_Port1Hexa
PP4.PinAttribute=FSBL,Appli
PP4.Signal=XSPIM_P1_IO4
PP5.GPIOParameters=GPIO_PuPd,PinAttribute
PP5.GPIO_PuPd=GPIO_PULLUP
PP5.Mode=XSPI1_Port1Hexa
PP5.PinAttribute=FSBL,Appli
PP5.Signal=XSPIM_P1_IO5
PP6.GPIOParameters=GPIO_PuPd,PinAttribute
PP6.GPIO_PuPd=GPIO_PULLUP
PP6.Mode=XSPI1_Port1Hexa
PP6.PinAttribute=FSBL,Appli
PP6.Signal=XSPIM_P1_IO6
PP7.GPIOParameters=GPIO_PuPd,PinAttribute
PP7.GPIO_PuPd=GPIO_PULLUP
PP7.Mode=XSPI1_Port1Hexa
PP7.PinAttribute=FSBL,Appli
PP7.Signal=XSPIM_P1_IO7
PP8.GPIOParameters=GPIO_PuPd,PinAttribute
PP8.GPIO_PuPd=GPIO_PULLUP
PP8.Mode=XSPI1_Port1Hexa
PP8.PinAttribute=FSBL,Appli
PP8.Signal=XSPIM_P1_IO8
PP9.GPIOParameters=GPIO_PuPd,PinAttribute
PP9.GPIO_PuPd=GPIO_PULLUP
PP9.Mode=XSPI1_Port1Hexa
PP9.PinAttribute=FSBL,Appli
PP9.Signal=XSPIM_P1_IO9
PQ3.ContextOwner=Appli
PQ3.GPIOParameters=GPIO_Label,PinAttribute
PQ3.GPIO_Label=LCD_ON_OFF
PQ3.Locked=true
PQ3.PinAttribute=Appli
PQ3.Signal=GPIO_Output
PQ6.ContextOwner=Appli
PQ6.GPIOParameters=GPIO_Label,PinAttribute
PQ6.GPIO_Label=LCD_BL_CTRL
PQ6.Locked=true
PQ6.PinAttribute=Appli
PQ6.Signal=GPIO_Output
PinOutPanel.CurrentBGAView=Top
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerLinker=GCC
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32N657X0HxQ
ProjectManager.Example=Template_FSBL_XIP
ProjectManager.ExampleSource=CubeFw
ProjectManager.FirmwarePackage=STM32Cube FW_N6 V1.3.0
ProjectManager.FreePins=false
ProjectManager.FreePinsContext=FSBL
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=FSBL-0x200,Appli-0x200,ExtMemLoader-0x200
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=2
ProjectManager.MainLocation=Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=Template_FSBL_XIP.ioc
ProjectManager.ProjectName=Template_FSBL_XIP
ProjectManager.ProjectStructure=FSBL\:FSBL\:true;Appli\:Appli\:true;ExtMemLoader\:ExtMemLoader\:false;
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=FSBL-0x800,Appli-0x800,ExtMemLoader-0x800
ProjectManager.TargetToolchain=EWARM V9.40
ProjectManager.ToolChainLocation=
ProjectManager.UAScriptAfterPath=
ProjectManager.UAScriptBeforePath=
ProjectManager.UnderRoot=false
